:PROPERTIES:
:header-args: :tangle moire-theme.el
:END:

** Color definition

NB: This table is the absolute source of truth!

#+begin_src shell :tangle no :results none
  cd ~/src/moire/generate
  ./script.sh
  open layout.png
#+end_src

  #+NAME: moire-colors
  | dark6    | #191922 |
  | dark5    | #1a1e28 |
  | dark4    | #23242f |
  | dark3    | #2f2c28 |
  | dark2    | #35332d |
  | dark1    | #47413b |
  | light1   | #786569 |
  | light2   | #6c5a5f |
  | light3   | #86727a |
  | light4   | #a5899a |
  | light5   | #bfa1b5 |
  | light6   | #eecde4 |
  | red      | #e1346d |
  | mauve    | #cf50cc |
  | pink     | #f57ed1 |
  | peach    | #e88b53 |
  | clay     | #d59b84 |
  | yellow   | #e6bf56 |
  | green    | #90ba56 |
  | teal     | #60cca7 |
  | denim    | #a2f1f9 |
  | royal    | #758fc6 |
  | blue     | #8070fd |
  | indigo   | #615dbb |
  | lavender | #ab88d8 |
  | purple   | #8544ac |

  I'd rather quantize in the writing step, rather than on a user's machine.

  #+NAME: tru-colors-list
  #+begin_src emacs-lisp :tangle no :var tab=moire-colors[,1] :var num=1
    (nth num tab)
  #+end_src
  
#+NAME: moire-colors-quantized
#+begin_src emacs-lisp :tangle no :var tab=moire-colors[,1]
    (defun quantize-to-256-colors (color)
      "quantize COLOR to 256 colors."
      (let ((i 1)
            (str "#"))
        (while (<= i 5)
          (setq str
                (concat str
                        (format
                         "%02x"
                         (* (round (/
                                    (string-to-number (substring color i (+ i 2)) 16)
                                    17))
                            17))))
          (setq i (+ i 2)))
        str))
    (mapcar 'quantize-to-256-colors tab)
#+end_src

#+RESULTS: moire-colors-quantized
| #cc5555 | #eeaadd | #88bbdd | #6699bb | #3366aa | #2233aa |

#+NAME: 256-colors-list
#+begin_src emacs-lisp :tangle no :var tab=moire-colors-quantized :var num=0
  (nth num tab)
#+end_src

#+RESULTS: 256-colors-list
: #cc5555

#+begin_src emacs-lisp :noweb yes
    (moire-deftheme
     moire
     "A moody pastel theme"
     ((((class color) (min-colors #xFFFFFF))
       ((class color) (min-colors #xFF)))
      (moire-dark6      "<<tru-colors-list(num=0)>>"  "<<256-colors-list(num=0)>>")
      (moire-dark5      "<<tru-colors-list(num=1)>>"  "<<256-colors-list(num=1)>>")
      (moire-dark4      "<<tru-colors-list(num=2)>>"  "<<256-colors-list(num=2)>>")
      (moire-dark3      "<<tru-colors-list(num=3)>>"  "<<256-colors-list(num=3)>>")
      (moire-dark2      "<<tru-colors-list(num=4)>>"  "<<256-colors-list(num=4)>>")
      (moire-dark1      "<<tru-colors-list(num=5)>>"  "<<256-colors-list(num=5)>>")
      (moire-light1     "<<tru-colors-list(num=6)>>"  "<<256-colors-list(num=6)>>")
      (moire-light2     "<<tru-colors-list(num=7)>>"  "<<256-colors-list(num=7)>>")
      (moire-light3     "<<tru-colors-list(num=8)>>"  "<<256-colors-list(num=8)>>")
      (moire-light4     "<<tru-colors-list(num=9)>>"  "<<256-colors-list(num=9)>>")
      (moire-light5     "<<tru-colors-list(num=10)>>" "<<256-colors-list(num=10)>>")
      (moire-light6     "<<tru-colors-list(num=11)>>" "<<256-colors-list(num=11)>>")
      (moire-red        "<<tru-colors-list(num=12)>>" "<<256-colors-list(num=12)>>")
      (moire-mauve      "<<tru-colors-list(num=13)>>" "<<256-colors-list(num=13)>>")
      (moire-pink       "<<tru-colors-list(num=14)>>" "<<256-colors-list(num=14)>>")
      (moire-peach      "<<tru-colors-list(num=15)>>" "<<256-colors-list(num=15)>>")
      (moire-clay       "<<tru-colors-list(num=16)>>" "<<256-colors-list(num=16)>>")
      (moire-yellow     "<<tru-colors-list(num=17)>>" "<<256-colors-list(num=17)>>")
      (moire-green      "<<tru-colors-list(num=18)>>" "<<256-colors-list(num=18)>>")
      (moire-teal       "<<tru-colors-list(num=19)>>" "<<256-colors-list(num=19)>>")
      (moire-denim      "<<tru-colors-list(num=20)>>" "<<256-colors-list(num=20)>>")
      (moire-royal      "<<tru-colors-list(num=21)>>" "<<256-colors-list(num=21)>>")
      (moire-blue       "<<tru-colors-list(num=22)>>" "<<256-colors-list(num=22)>>")
      (moire-indigo     "<<tru-colors-list(num=23)>>" "<<256-colors-list(num=23)>>")
      (moire-lavender   "<<tru-colors-list(num=24)>>" "<<256-colors-list(num=24)>>")
      (moire-purple     "<<tru-colors-list(num=25)>>" "<<256-colors-list(num=25)>>"))

      (custom-theme-set-variables 'moire
                                  `(ansi-color-names-vector
                                    [,moire-dark6
                                     ,moire-red
                                     ,moire-green
                                     ,moire-yellow
                                     ,moire-blue
                                     ,moire-purple
                                     ,moire-teal
                                     ,moire-light1])))
#+end_src

#+begin_src shell :shebang #!/bin/sh :tangle generate/script.sh :mkdirp yes :noweb yes
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=0)>>" -draw "circle 47.5,47.5 47.5,0" moire-00dark6.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=1)>>" -draw "circle 47.5,47.5 47.5,0" moire-01dark5.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=2)>>" -draw "circle 47.5,47.5 47.5,0" moire-02dark4.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=3)>>" -draw "circle 47.5,47.5 47.5,0" moire-03dark3.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=4)>>" -draw "circle 47.5,47.5 47.5,0" moire-04dark2.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=5)>>" -draw "circle 47.5,47.5 47.5,0" moire-05dark1.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=6)>>" -draw "circle 47.5,47.5 47.5,0" moire-06light1.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=7)>>" -draw "circle 47.5,47.5 47.5,0" moire-07light2.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=8)>>" -draw "circle 47.5,47.5 47.5,0" moire-08light3.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=9)>>" -draw "circle 47.5,47.5 47.5,0" moire-09light4.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=10)>>" -draw "circle 47.5,47.5 47.5,0" moire-10light5.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=11)>>" -draw "circle 47.5,47.5 47.5,0" moire-11light6.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=12)>>" -draw "circle 47.5,47.5 47.5,0" moire-12red.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=13)>>" -draw "circle 47.5,47.5 47.5,0" moire-13mauve.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=14)>>" -draw "circle 47.5,47.5 47.5,0" moire-14pink.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=15)>>" -draw "circle 47.5,47.5 47.5,0" moire-15peach.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=16)>>" -draw "circle 47.5,47.5 47.5,0" moire-16clay.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=17)>>" -draw "circle 47.5,47.5 47.5,0" moire-17yellow.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=18)>>" -draw "circle 47.5,47.5 47.5,0" moire-18green.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=19)>>" -draw "circle 47.5,47.5 47.5,0" moire-19teal.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=20)>>" -draw "circle 47.5,47.5 47.5,0" moire-20denim.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=21)>>" -draw "circle 47.5,47.5 47.5,0" moire-21royal.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=22)>>" -draw "circle 47.5,47.5 47.5,0" moire-22blue.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=23)>>" -draw "circle 47.5,47.5 47.5,0" moire-23indigo.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=24)>>" -draw "circle 47.5,47.5 47.5,0" moire-24lavender.png
  convert -size 96x96 canvas:transparent -fill "<<tru-colors-list(num=25)>>" -draw "circle 47.5,47.5 47.5,0" moire-25purple.png
  convert -append moire-*.png layout.png
#+end_src

